# GetNumberOfNodes Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPAnalyticalModelData..::..GetNumberOfNodes Method
MEPAnalyticalModelData Class See Also
---
Returns the number of analytical nodes.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public int GetNumberOfNodes()
```

Visual Basic
---
```text
Public Function GetNumberOfNodes As Integer
```

Visual C++
---
```text
public:
int GetNumberOfNodes()
```

# See Also
MEPAnalyticalModelData Class
Autodesk.Revit.DB.Analysis Namespace